In [1]:
# # Challenge psuedo-code.
# - Use groupby(), function with count() and sum()
# - Get Total number of rides,
#             number of drivers,
#             total fares,
#                 for each city type.
# Then, Calculate
#             Avg. fare per ride,
#             Avg. fare per driver,
#                 for each city type. 
            
# End, Add New DataFrame:
#             Format the columns.

In [54]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import datetime as dt

# File to Load (Remember to change these)
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

# Read the City and Ride Data
city_data_df = pd.read_csv(city_data_to_load)
ride_data_df = pd.read_csv(ride_data_to_load)

In [55]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the data table for preview
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.908450e+12,46,Urban

In [56]:
#  1. Get the total rides for each city type
rides_by_city = pyber_data_df.groupby('type').count().ride_id
rides_by_city

type
Rural        125
Suburban     625
Urban       1625
Name: ride_id, dtype: int64

In [57]:
# 2. Get the total drivers for each city type
drivers_by_city_type = city_data_df.groupby('type').sum().driver_count
drivers_by_city_type

type
Rural         78
Suburban     490
Urban       2405
Name: driver_count, dtype: int64

In [58]:
#  3. Get the total amount of fares for each city type
fares_by_city_type = pyber_data_df.groupby('type').sum().fare
fares_by_city_type

type
Rural        4327.93
Suburban    19356.33
Urban       39854.38
Name: fare, dtype: float64

In [59]:
#  4. Get the average fare per ride for each city type. 
avg_fare_by_city_type = pyber_data_df.groupby('type').mean().fare
avg_fare_by_city_type

type
Rural       34.623440
Suburban    30.970128
Urban       24.525772
Name: fare, dtype: float64

In [60]:
# 5. Get the average fare per driver for each city type. 
avg_driver_fare_by_city_type = pyber_data_df.groupby('type').sum().fare / drivers_by_city_type
avg_driver_fare_by_city_type

type
Rural       55.486282
Suburban    39.502714
Urban       16.571468
dtype: float64

In [61]:
#  6. Create a PyBer summary DataFrame. 
pyber_summary_df = pd.DataFrame(
            {'Total Rides':rides_by_city,
             'Total Drivers':drivers_by_city_type,
             'Total Fares':fares_by_city_type,
             'Average Fare per Ride':avg_fare_by_city_type,
             'Average Fare per Driver':avg_driver_fare_by_city_type}
            )
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
type,,,,,
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [62]:
#  7. Cleaning up the DataFrame. Delete the index name
pyber_summary_df.index.name = None
pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,4327.93,34.623440,55.486282
Suburban,625,490,19356.33,30.970128,39.502714
Urban,1625,2405,39854.38,24.525772,16.571468

In [63]:
#  8. Format the columns.
pyber_summary_df['Total Rides'] = pyber_summary_df['Total Rides'].map('{:,}'.format)
pyber_summary_df['Total Drivers'] = pyber_summary_df['Total Drivers'].map('{:,}'.format)
pyber_summary_df['Total Fares'] = pyber_summary_df['Total Fares'].map('${:,.2f}'.format)
pyber_summary_df['Average Fare per Ride'] = pyber_summary_df['Average Fare per Ride'].map('${:,.2f}'.format)
pyber_summary_df['Average Fare per Driver'] = pyber_summary_df['Average Fare per Driver'].map('${:,.2f}'.format)

pyber_summary_df

,Total Rides,Total Drivers,Total Fares,Average Fare per Ride,Average Fare per Driver
Rural,125,78,"$4,327.93",$34.62,$55.49
Suburban,625,490,"$19,356.33",$30.97,$39.50
Urban,"1,625","2,405","$39,854.38",$24.53,$16.57

In [64]:
# Deliverable 2. Create a multiple line plot that shows the total weekly of the fares for each type of city.

In [65]:
# 1. Read the merged DataFrames
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,1/14/2019 10:14,13.83,5.739410e+12,5,Urban
1,South Michelleport,3/4/2019 18:24,30.24,2.343910e+12,72,Urban
2,Port Samanthamouth,2/24/2019 4:29,33.44,2.005070e+12,57,Urban
3,Rodneyfort,2/10/2019 23:22,23.44,5.149250e+12,34,Urban
4,South Jack,3/6/2019 4:28,34.58,3.908450e+12,46,Urban

In [66]:
# 2. Using groupby() to create a new DataFrame showing the sum of the fares 
#  for each date where the indices are the city type and date.
fare_by_city_date_df = pyber_data_df.groupby(['type','date']).sum().fare.to_frame()
fare_by_city_date_df.head()

                        fare
type  date
Rural 1/1/2019 9:45    43.69
      1/11/2019 4:39   16.42
      1/14/2019 15:58  54.10
      1/14/2019 7:09   18.05
      1/15/2019 21:44  30.26

In [67]:
# 3. Reset the index on the DataFrame you created in #1. This is needed to use the 'pivot()' function.
# df = df.reset_index()
fare_by_city_date_df = fare_by_city_date_df.reset_index()
fare_by_city_date_df.head()

    type             date   fare
0  Rural    1/1/2019 9:45  43.69
1  Rural   1/11/2019 4:39  16.42
2  Rural  1/14/2019 15:58  54.10
3  Rural   1/14/2019 7:09  18.05
4  Rural  1/15/2019 21:44  30.26

In [68]:
# 4. Create a pivot table with the 'date' as the index, the columns ='type', and values='fare' 
# to get the total fares for each type of city by the date. 
fare_by_city_date_df = fare_by_city_date_df.pivot(index='date',columns='type', values='fare')
fare_by_city_date_df.head()

type            Rural  Suburban  Urban
date
1/1/2019 0:08     NaN       NaN  37.91
1/1/2019 0:46     NaN     47.74    NaN
1/1/2019 12:32    NaN     25.56    NaN
1/1/2019 14:40    NaN       NaN   5.42
1/1/2019 14:42    NaN       NaN  12.31

In [78]:
# 5. Create a new DataFrame from the pivot table DataFrame using loc on the given dates, '2019-01-01':'2019-04-29'.
fare_dates_df = fare_by_city_date_df.loc['01/01/2019':'04/29/2019']
fare_dates_df

Empty DataFrame
Columns: [Rural, Suburban, Urban]
Index: []

In [79]:
df = pd.DataFrame({'date':['2015-02-21 12:08:51']})
df

                  date
0  2015-02-21 12:08:51

In [71]:
df['date'] = pd.to_datetime(df['date']).dt.date
df

         date
0  2015-02-21

In [72]:
test_col = pyber_data_df['date']

In [73]:
df = pd.DataFrame({'date' : test_col})
df

                 date
0     1/14/2019 10:14
1      3/4/2019 18:24
2      2/24/2019 4:29
3     2/10/2019 23:22
4       3/6/2019 4:28
...               ...
2370  4/29/2019 17:04
2371   1/30/2019 0:05
2372  2/10/2019 21:03
2373   5/7/2019 19:22
2374  4/25/2019 10:20

[2375 rows x 1 columns]

In [74]:
df['date'] = pd.to_datetime(df['date']).dt.date
df.head()

         date
0  2019-01-14
1  2019-03-04
2  2019-02-24
3  2019-02-10
4  2019-03-06

In [75]:
df.set_index('date')

Empty DataFrame
Columns: []
Index: [2019-01-14, 2019-03-04, 2019-02-24, 2019-02-10, 2019-03-06, 2019-03-11, 2019-02-27, 2019-04-26, 2019-01-08, 2019-03-09, 2019-02-07, 2019-01-12, 2019-03-02, 2019-01-10, 2019-05-04, 2019-03-28, 2019-01-03, 2019-02-26, 2019-03-06, 2019-04-25, 2019-02-24, 2019-05-01, 2019-03-19, 2019-04-25, 2019-02-19, 2019-05-03, 2019-03-14, 2019-04-01, 2019-02-10, 2019-01-11, 2019-03-18, 2019-01-15, 2019-02-02, 2019-02-28, 2019-02-03, 2019-02-12, 2019-02-15, 2019-02-18, 2019-03-12, 2019-02-24, 2019-03-14, 2019-03-25, 2019-05-08, 2019-04-25, 2019-04-23, 2019-03-05, 2019-03-03, 2019-05-05, 2019-03-19, 2019-03-03, 2019-03-03, 2019-02-18, 2019-02-14, 2019-05-08, 2019-05-02, 2019-04-24, 2019-03-10, 2019-05-04, 2019-03-03, 2019-03-01, 2019-04-03, 2019-01-19, 2019-04-17, 2019-04-04, 2019-03-16, 2019-01-30, 2019-04-26, 2019-03-22, 2019-01-15, 2019-04-06, 2019-03-02, 2019-01-07, 2019-03-18, 2019-02-23, 2019-02-24, 2019-02-09, 2019-04-07, 2019-03-17, 2019-02-20, 2019-04-19, 2019-03-02, 2019-03-03, 2019-02-25, 2019-04-16, 2019-01-23, 2019-01-07, 2019-01-05, 2019-03-06, 2019-01-07, 2019-05-03, 2019-03-11, 2019-01-30, 2019-04-04, 2019-02-19, 2019-01-23, 2019-03-29, 2019-03-08, 2019-04-17, 2019-01-11, 2019-01-17, ...]

[2375 rows x 0 columns]

In [77]:
pyber_data_df['date'] = pd.to_datetime(pyber_data_df["date"].dt.strftime('%Y-%m-%d %X'))

AttributeError: Can only use .dt accessor with datetimelike values